oriflame/src/test/resources/ppoo.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <PALLET_OUTBOUND_ORDER xmlns="urn:ifsworld-com:schemas:post_pallet_outbound_order">
            <CUSTOMER_NO>BEL</CUSTOMER_NO>
            <GLN_SENDER>1234567890</GLN_SENDER>
            <PALLET_QTY>1.0</PALLET_QTY>
            <SHIPMENT_ID>0000000000</SHIPMENT_ID>
            <SITE>DCBUD</SITE>
            <PALLET_OUTBOUND_HEADERS>
                <PALLET_OUTBOUND_HEADER>
                    <COMPLETE_INSPECTION>0.0</COMPLETE_INSPECTION>
                    <COURIER_ID>8</COURIER_ID>
                    <COURIER_NAME>City Expre</COURIER_NAME>
                    <DESTINATION_ID>90</DESTINATION_ID>
                    <FULLPACKER_PICKING>123.0</FULLPACKER_PICKING>
                    <GLN_RECEIVER>1234567890</GLN_RECEIVER>
                    <GROSS_WEIGHT>170.72</GROSS_WEIGHT>
                    <PALLET_ID>O266744</PALLET_ID>
                    <PALLET_WEIGHT>15.0</PALLET_WEIGHT>
                    <SHIP_VIA_CODE>G</SHIP_VIA_CODE>
                    <SINGLEUNIT_PICKING>456.0</SINGLEUNIT_PICKING>
                    <STATUS>INSPECTED</STATUS>
                    <PALLET_OUTBOUND_CONSIGNMENTS>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196334</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003720896</BOX_ID>
                                    <TRACKING_ID>157229</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196344</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721093</BOX_ID>
                                    <TRACKING_ID>157224</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196363</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003739333</BOX_ID>
                                    <TRACKING_ID>157182</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196386</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721129</BOX_ID>
                                    <TRACKING_ID>157176</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196429</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721092</BOX_ID>
                                    <TRACKING_ID>157215</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196441</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003720950</BOX_ID>
                                    <TRACKING_ID>157177</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196483</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003739195</BOX_ID>
                                    <TRACKING_ID>157201</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196488</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003739296</BOX_ID>
                                    <TRACKING_ID>157219</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196514</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721130</BOX_ID>
                                    <TRACKING_ID>157187</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196535</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721113</BOX_ID>
                                    <TRACKING_ID>157204</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196543</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003739327</BOX_ID>
                                    <TRACKING_ID>157235</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196894</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721290</BOX_ID>
                                    <TRACKING_ID>157228</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3196904</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721102</BOX_ID>
                                    <TRACKING_ID>157199</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3197481</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721094</BOX_ID>
                                    <TRACKING_ID>157210</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3197689</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721109</BOX_ID>
                                    <TRACKING_ID>157216</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3197763</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003739198</BOX_ID>
                                    <TRACKING_ID>157181</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3197994</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003720909</BOX_ID>
                                    <TRACKING_ID>157218</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                        <PALLET_OUTBOUND_CONSIGNMENT>
                            <CONSIGNMENT_ID>3201642</CONSIGNMENT_ID>
                            <CRT_QTY>1.0</CRT_QTY>
                            <PALLET_OUTBOUND_BOXES>
                                <PALLET_OUTBOUND_BOX>
                                    <BOX_ID>0003721106</BOX_ID>
                                    <TRACKING_ID>157203</TRACKING_ID>
                                </PALLET_OUTBOUND_BOX>
                            </PALLET_OUTBOUND_BOXES>
                        </PALLET_OUTBOUND_CONSIGNMENT>
                    </PALLET_OUTBOUND_CONSIGNMENTS>
                </PALLET_OUTBOUND_HEADER>
            </PALLET_OUTBOUND_HEADERS>
        </PALLET_OUTBOUND_ORDER>
    </soap:Body>
</soap:Envelope>
